# Manage MacOS packages with `brew bundle`
## File initially generated with `brew bundle dump --all --describe`

tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "yt-dlp/taps"

# Automatically restart SSH sessions and tunnels
brew "autossh"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Official Amazon AWS command-line interface
brew "awscli"
# Command-line benchmark tool
brew "bench"
# Interpreted, interactive, object-oriented programming language
brew "cocoapods"
# SQL-like query language for csv
brew "csvq"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Powerful paging program
brew "most"
# Trigger notifications when a process completes
brew "noti"
# Manage multiple Node.js versions
brew "nvm"
# Advanced filtering web proxy
brew "privoxy", restart_service: true
# QR Code generation
brew "qrencode"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Editor of encrypted files
brew "sops"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# Suite of barcodes-reading tools
brew "zbar"
# UNIX shell (command interpreter)
brew "zsh"
# A youtube-dl fork with additional features and fixes
brew "yt-dlp/taps/yt-dlp"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tools for building Android applications
cask "android-studio"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Server and cloud storage browser
cask "cyberduck"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# Noise cancelling application
cask "krisp"
# Video format converter (transcoder)
cask "makemkv"
# Online collaborative whiteboard platform
cask "miro"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# Design animated and interactive user interfaces
cask "principle"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Digital design and prototyping platform
cask "sketch"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# File transfer application
cask "transmit"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Development environment
cask "vagrant"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Desktop client for WhatsApp
cask "whatsapp"
# Share, organize and collaborate on designs
cask "zeplin"
# Video communication and virtual meeting platform
cask "zoom"

# Powerful keep awake utility
mas 'Amphetamine', id: 937984704
